#include "timer.h"
#include "systick.h"


/*/////////////////////////////////////////////////////////////////////////////////
本程序是定时器控制蜂鸣器源文件
作用：
1.TIM2时钟初始化
2.存放音调和节拍
3.实现程序
（适合STM32F10x系列）
更正日期:2019/01/05
All rights reserved
********************************************************************************/

//通用定时器3中断初始化
//这里时钟选择为APB1的2倍，而APB1为36M
//arr：自动重装值。
//psc：时钟预分频数
//这里使用的是定时器3!
void Timer2_Init(u16 Period)//用来产生音调的频率
{
	GPIO_InitTypeDef GPIO_Init_Structure;
	TIM_TimeBaseInitTypeDef TIM_TimeBaseInit_Structure;
	TIM_OCInitTypeDef TIM_OCInit_Structure;

	RCC_APB1PeriphClockCmd(RCC_APB1Periph_TIM2, ENABLE);//打开定Timer2时钟
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA, ENABLE);//打开GPIOB时钟

	GPIO_Init_Structure.GPIO_Pin = GPIO_Pin_2;
	GPIO_Init_Structure.GPIO_Mode = GPIO_Mode_AF_PP;//手册8.1.11复用推挽输出
	GPIO_Init_Structure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_Init(GPIOA, &GPIO_Init_Structure);

	TIM_TimeBaseInit_Structure.TIM_CounterMode = TIM_CounterMode_Up;//向上计数模式
	TIM_TimeBaseInit_Structure.TIM_Period = Period;//周期
	TIM_TimeBaseInit_Structure.TIM_Prescaler = 7199;//分频
	TIM_TimeBaseInit(TIM2, &TIM_TimeBaseInit_Structure);

	TIM_OCInit_Structure.TIM_OCMode = TIM_OCMode_PWM2;
	TIM_OCInit_Structure.TIM_OCPolarity = TIM_OCPolarity_High;
	TIM_OCInit_Structure.TIM_OutputState = TIM_OutputState_Enable;
	TIM_OCInit_Structure.TIM_Pulse = Period;//占空比
	TIM_OC3Init(TIM2, &TIM_OCInit_Structure);

	TIM_OC3PreloadConfig(TIM2, TIM_OCPreload_Enable);

	TIM_Cmd(TIM2, ENABLE);
}


int music[] =//生日快乐歌C调简谱C语言表示方法(M5,50)为(音调，音长)100表示为一个音长(节拍)，
	//50位半个音长(节拍)，25位四分之一音长(节拍)
{
	M5,50,M5,25,M5,25,
	M6,100,M5,100,H1,100,
	M7,100,M7,100,M5,50,M5,25,M5,25,
	M6,100,M5,100,H2,100,
	H1,100,H1,100,M5,50,M5,25,M5,25,
	H5,100,H3,100,H1,100,
	M7,100,M6,100,H4,50,H4,25,H4,25,
	H3,100,H1,100,H2,100,H1,100,H1,100,
};

int music1[]=//茉莉花
{
M5,100,M5,50,B6,50,H1,50,C2,50,C2,50,H1,50,
B6,100,B6,50,H1,50,B6,100,
M5,100,M5,50,B6,50,H1,50,C2,50,C2,50,H1,50,
B6,100,B6,50,H1,50,B6,100,
B6,100,B6,100,B6,100,M5,50,B6,50,
H1,100,H1,100,B6,100,
M5,100,M4,50,M5,50,B6,100,M5,50,M4,50,
B2,100,B2,50,M4,50,B2,100,
M5,50,M4,50,B2,50,M5,50,M4,150,M5,50,
B6,100,B6,100,H1,50,C2,50,B6,100,
M4,100,M5,50,B6,50,M4,50,M5,50,B2,50,M1,50,
A6,100,A6,100,M1,100,B2,100,
M4,150,M5,50,B2,50,M4,50,B2,50,M1,50,A6,150,P0,100,
};

int music2[]=//铃儿响叮当
{
M1,50,M6,50,M5,50,M4,50,M1,150,M1,25,M1,25,M1,50,M6,50,M5,50,M4,50,M2,150,M2,50,
M2,50,B6,50,M6,50,M5,50,M3,150,M3,50,H1,50,H1,50,B6,50,M5,50,M6,100,M4,100,M1,50,M6,50,M5,50,M4,50,M1,150,M1,50,
M1,50,M6,50,M5,50,M4,50,M2,150,M2,50,M2,50,B6,50,M6,50,M5,50,H1,50,H1,50,H1,50,H1,50,
H2,50,H1,50,B6,50,M5,50,M4,100,M6,50,M6,50,M6,100,M6,50,M6,50,M6,50,M6,50,H1,50,M4,75,M5,25,M6,100,
B6,50,B6,50,B6,75,B6,25,B6,50,M6,50,M6,50,M6,25,M6,25,M6,50,M5,50,M5,50,M4,50,M5,100,H1,100,
M6,50,M6,50,M6,100,M6,50,M6,50,M6,100,M6,50,H1,50,M4,75,M5,25,M6,100,
B6,50,B6,50,B6,75,B6,25,B6,50,M6,50,M6,50,M6,25,M6,25,H1,50,H1,50,B6,50,M5,50,M4,100,
};

int music3[]=//天空之城
{
M6,50,M7,50,H1,150,M7,50,H1,100,H3,100,M7,300,M3,50,M6,150,
M5,50,M6,100,H1,100,M5,300,M4,50,M3,50,M4,150,M3,50,M4,100,H1,100,
M3,200,H1,50,H1,50,H1,50,M7,150,H4,50,M4,100,M7,100,M7,200,
M6,100,M7,100,H1,150,M7,50,H1,100,H3,100,M7,300,M3,50,M3,50,
M6,150,M5,50,M6,100,H1,100,
M5,300,M3,100,M4,100,H1,50,M7,50,H1,50,H2,100,H3,50,H1,50,
H1,50,M7,50,M6,100,M7,100,H5,100,M6,300,H1,50,H2,50,H3,150,H2,50,
H3,100,H5,100,H2,300,M5,50,M5,50,H1,150,M7,50,H1,100,H3,100,H3,400,
M6,100,M7,100,H1,100,M7,50,H1,50,H2,100,H1,150,M5,50,M5,100,H4,100,H3,100,
H2,100,H1,100,H3,700,H3,100,H6,100,H5,100,H3,100,H2,50,H1,50,	
};

int music4[]=//最炫民族风
{
	L6,100,L6,50,L5,50,L6,100,L6,50,M1,50,
M1,100,M2,50,M1,50,L6,200,
M1,100,M1,50,L5,50,M1,50,M2,50,M3,50,M5,50,
M5,50,M3,50,M2,100,M3,200,
M6,50,M6,50,M6,50,M5,50,M3,50,M3,100,M1,50,
L6,50,L6,50,L6,50,M3,50,M2,200,
M3,50,M3,50,M5,50,M3,50,M2,50,M3,50,M2,50,M1,50,
L6,100,L5,100,L6,200, //摆，什么样的歌声才是最呀最摇
M3,50,M3,50,M5,50,M3,50,M3,50,M5,50,M5,50,M6,50,
H1,50,M6,50,M5,100,M6,200, //我们要唱就要唱的最痛快
L6,100,L6,50,L5,50,L6,100,M1,100,
M2,50,M3,50,M2,50,M1,50,M2,50,M3,200,
L6,50,M6,50,M6,50,M5,50,M2,50,M3,50,M2,50,M1,50,M2,50,M3,200,//留下来
M1,50,L6,50, M1,50,M2,100,L5,50,L5,50,
M3,50,M5,50,M3,50,M2,50,M1,200,
L6,50,M1,50,M2,50,M3,50,M2,50,M1,50,L5,50,L3,50,
L6,200,L6,100,L6,50,L5,50,L6,100,M1,100,M2,50,M3,50,M2,50,M1,50,M2,50,M3,200,
L6,50,M6,50,M6,50,M5,50,M2,50,M3,50,M2,50,M1,50, //留下来
M1,50,L6,50,L6,50,M1,50,M2,100,L5,50,L5,50,
M3,50,M5,50,M3,50,M2,50,M1,100+50,
M1,50,L6,50,M1,50,M2,50,M5,50,M5,50,
M3,50,M3,50,M5,50,
};

int music5[]=//千本樱
{
M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,	M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,M4,50,M3,50,M4,12,M3,12,M2,25,M1,50,	M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,	M5,50,M6,50,H1,50,H4,50,H3,25,H4,25,H3,25,H2,25,H1,50,M6,50,
M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,	M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,M4,50,M3,50,M4,12,M3,12,M2,25,M1,50,
M2,50,M1,25,M2,25,M4,50,M2,25,M4,25,M6,50,M5,25,M6,25,H1,50,M6,25,H1,25,	H4,50,H3,25,H4,12,H3,12,H2,50,H1,50,H2,100,M2,50,M4,50,
M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,	M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,M4,50,M3,50,M4,12,M3,12,M2,25,M1,50,	M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,	M5,50,M6,50,H1,50,H4,50,H3,25,H4,25,H3,25,H2,25,H1,50,M6,50,
M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,	M5,50,M6,50,M2,25,M1,25,M2,25,M1,25,M4,50,M3,50,M4,12,M3,12,M2,25,M1,50,
M5,25,M4,25,M6,25,H1,25,H2,25,H1,25,M6,25,M5,25,M2,75,M4,25,M5,50,M6,50,	M2,50,M2,25,M2,25,P0,50,M1,50,M2,100,P0,100,
M2,75,M2,25,M2,50,M1,50,M2,50,M4,50,M4,50,M5,50,	M2,75,M2,25,M2,50,M1,50,M2,50,M1,50,L6,50,M1,50,	M2,75,M2,25,M2,50,M1,50,M2,50,M4,50,M4,50,M5,50,	M6,100,M5,50,M6,25,M5,25,M4,100,M2,100,
M2,75,M2,25,M2,50,M1,50,M2,50,M4,50,M4,50,M5,50,	M2,75,M2,25,M2,50,M1,50,M2,50,M1,50,M1,50,L6,50,	M2,75,M2,25,M2,50,M1,50,M2,50,M4,50,M4,50,M5,50,	M6,100,M5,50,M6,25,M5,25,M4,100,M2,100,
M4,100,M3,100,M2,100,M1,100,	M1,50,M1,25,M2,25,L6,50,L5,50,L6,100,	L6,50,M1,100,M2,50,M5,100,M3,100,	M4,75,M4,25,M3,50,M1,50,M2,100,
M4,100,M3,100,M2,100,M1,100,	M1,50,M1,25,M2,25,L6,50,L5,50,L6,100,L6,50,M1,50,	M2,50,M2,100,M2,50,M4,100,M5,100,	M3,100,M3,100,M3,100,M2,50,M4,50,
M5,50,M5,25,M5,25,M5,50,M6,50,M6,75,M6,25,	H1,50,H2,50,M5,50,M4,50,M6,100,M2,50,M4,50,	M5,50,M5,25,M5,25,M5,50,M6,50,M6,75,M6,50,	B6,50,M6,50,M5,50,M4,50,M4,100,M2,50,M4,50,
M5,50,M5,25,M5,25,M5,50,M6,50,M6,75,M6,25,	H1,50,H2,50,M5,50,M4,50,M6,100,M2,50,M4,50,	B6,100,M6,100,M5,100,M4,100,	M5,50,M6,50,M4,50,M1,50,M2,100,M2,50,M4,50,
M5,50,M4,50,M6,50,H1,50,H2,100,P0,100,P0,1200,
M4,100,M3,100,M2,100,M1,100,	M1,50,M1,25,M2,25,L6,50,L5,50,L6,100,	L6,50,M1,100,M2,50,M5,100,M3,100,	M4,75,M4,25,M3,50,M1,50,M2,100,
M4,100,M3,100,M2,100,M1,100,	M1,50,M1,25,M2,25,L6,50,L5,50,L6,100,L6,50,M1,50,	M2,50,M2,100,M2,50,M4,100,M5,100,	M3,100,M3,100,M3,100,M2,50,M4,50,
M5,50,M5,25,M5,25,M5,50,M6,50,M6,75,M6,25,	H1,50,H2,50,M5,50,M4,50,M6,100,M2,50,M4,50,	M5,50,M5,25,M5,25,M5,50,M6,50,M6,75,M6,50,	B6,50,M6,50,M5,50,M4,50,M4,100,M2,50,M4,50,
M5,50,M5,25,M5,25,M5,50,M6,50,M6,75,M6,25,	H1,50,H2,50,M5,50,M4,50,M6,100,M2,50,M4,50,	B6,100,M6,100,M5,100,M4,100,	M5,50,M6,50,M5,50,M6,50,M6,100,M3,50,M5,50,
M6,50,M6,25,M6,25,M6,50,M7,50,M7,150,M7,50,	H2,50,H3,50,M6,50,M5,50,M7,100,M3,50,M5,50,	M6,50,M6,25,M6,25,M6,50,M7,50,M7,75,M7,25,	H1,50,M7,50,M6,50,M5,50,M5,100,M3,50,M5,50,
M6,50,M6,25,M6,25,M6,50,M7,50,M7,150,M7,50,	H2,50,H3,50,M6,50,M5,50,M7,100,M3,50,M5,50,	H1,100,M7,100,M6,100,M5,100,	M6,50,M5,50,M7,50,H2,50,H3,100,};

int music6[]=//欢乐颂
	{
M3,50,M3,50,M4,50,M5,50,
M5,50,M4,50,M3,50,M2,50,
M1,50,M1,50,M2,50,M3,50,
M3,75,M2,25,M2,50,
M3,50,M3,50,M4,50,M5,50,
M5,50,M4,50,M3,50,M2,50,
M1,50,M1,50,M2,50,M3,50,
M2,75,M1,25,M1,50,P0,
M2,50,M2,50,M3,50,M1,50,
M2,50,M3,25,M4,25,M3,50,M1,50,
M2,50,M3,25,M4,25,M3,50,M2,50,
M1,50,M2,50,M5,50,M3,50,
M5,50,M4,50,M3,50,M2,50,
M1,50,M1,50,M2,50,M3,50,
M2,75,M1,25,M1,50,P0,
M5,50,M5,50,M5,50,M5,50,
M5,50,M5,50,M5,50,M5,50,
M5,50,M5,50,M5,25,M3,25,M4,25,M5,25,
M6,25,M5,25,M4,50,M5,50,M5,50,
};
	int music7[]=//试音时间
	{
A1,500,
A2,500,
A4,500,
A5,500,
A6,500,
L1,500,
B1,500,
L2,500,
B2,500,
L3,500,
L4,500,
B4,500,
L5,500,
B5,500,
L6,500,
B6,500,
L7,500,
M1,500,
C1,500,
M2,500,
C2,500,
M3,500,
M4,500,
C4,500,
M5,500,
C5,500,
M6,500,
C6,500,
M7,500,
H1,500,
H2,500,
H3,500,
H4,500,
H5,500,
H6,500,
H7,500,
	};

//void Music_Quiet(void)
//{
//	if(KEY3==0){
//		TIM_Cmd(TIM2, DISABLE);  //停止TIM2
//		delay_ms(5);
//		
//		}
//	
//		for(u32 i=0;i<=9999999;i++)
//	{
//		delay_ms(10);
//		if (KEY4==0) {TIM_Cmd(TIM2, ENABLE);break;}
//	}
//}


	void Music_Play(char c)
{	//按号唱歌
	 int *p;
	int length;
	switch(c){
		case -1:
			p=music6;
		length=100;
		break;
		case 0:
			p=music;
		length=64;
		break;
		case 1:
			p=music1;
		length=140;
		break;
		case 2:
			p=music2;
		length=202;
		break;
		case 3:
			p=music3;
		length=130;
		break;
		case 4:
			p=music4;
		length=274;
		break;
			case 5:
			p=music5;
		length=976;
		break;
			case 6:
				p=music6;
				length=60;
			break;
	}

		for (int i = 0; i < (length / 2); i++)							//取数组数据
	{
		LCD_ID(c);																					//显示曲目名
		//LED_Start();
				if(KEY1==0);
		 else if(KEY2==0);																		//利用节拍延时消抖
		Timer2_Init(p[2 * i]);															//PWM波周期
		LED_hlhs(p[2*i]);																		//花里胡哨（音调）灯启动
		delay_ms(5 * p[2 * i + 1]);
		//音长的时间都乘以5即一拍为500微秒，此值"5"可调整，只是播放的整个快慢而已，有点类似于视频快进和后退
		LED_hlhs(p[2*i]);															//花里胡哨（音调）灯节拍打完熄灭
		//Scan(0);							//按键扫描
		
		if(KEY1==0) break;
		else if(KEY2==0) break;
/******************************KEY3暂停实现************************************/		
		 if(KEY3==0){ 
			do{
		TIM_Cmd(TIM2, DISABLE);				//停止TIM2
				if(KEY2==0)
		delay_ms(8);
				if(KEY2==0)
					for (int i = 0; i < (length / 2); i++)							//取数组数据
	{
		Timer2_Init(music7[2 * i]);															//PWM波周期
		LED_hlhs(music7[2*i]);																		//花里胡哨（音调）灯启动
		delay_ms(5 * music7[2 * i + 1]);
		LED_hlhs(music7[2*i]);																		//花里胡哨（音调）灯节拍打完熄灭
	if (KEY4==0) break;}
					
		LCD_draw_bmp_pause(0,0,0,48,48);																//显示暂停图																					//超级延时作暂停
	
		LCD_clear();
		LCD_draw_bmp_pause(0,0,0,48,48);
		LCD_Write_words(50,50,3,46,12);
		LED_Pause();
		Display_Pause();
		delay_ms(10);}
		while (KEY4==1);
		}
/**************************暂停程序结束************************/	
				}//唱歌程序结束
		
	
	
	}











